In [2]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [3]:
df1=pd.read_csv('Patient_Data.csv')

In [4]:
df1.shape

(6, 7)

In [5]:
df1.head()

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

In [7]:
df2=pd.read_csv('Billing_Data.csv')

In [8]:
df2.shape

(5, 3)

In [9]:
df2.head()

   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000

In [10]:
df1.columns

Index(['PatientID', 'Name', 'Department', 'Doctor', 'BillAmount',
       'ReceptionistID', 'CheckInTime'],
      dtype='object')

In [11]:
selected_columns=df1[['PatientID','Department','Doctor','BillAmount']]
selected_columns

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

In [12]:
df1=df1.drop(columns=['ReceptionistID', 'CheckInTime'])
df1

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

In [13]:
total_bill_per_dept=df1.groupby('Department')['BillAmount'].sum().reset_index()
print(total_bill_per_dept)

    Department  BillAmount
0   Cardiology     16200.0
1  Dermatology         0.0
2    Neurology         0.0
3  Orthopedics      7500.0

In [14]:
df1.duplicated().sum()

np.int64(1)

In [15]:
df1.drop_duplicates(subset='PatientID')

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN

In [16]:
df1.head()

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN

In [17]:
df1.fillna({'BillAmount':df1.BillAmount.mean()},inplace=True)

In [18]:
df1.head()

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John      5925.0
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose      5925.0

In [19]:
merged_df=pd.merge(df1,df2,on='PatientID')

In [20]:
merged_df.head()

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,2000,3000
1,102,Bob,Neurology,Dr. John,5925.0,1500,3500
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,2500,5000
3,104,David,Cardiology,Dr. Smith,6200.0,3000,3200
4,105,Eva,Dermatology,Dr. Rose,5925.0,1000,4000

In [21]:
merged_df.shape

(6, 7)

In [22]:
new_patients=pd.DataFrame({'PatientID':[106,107],'Name':['James','Rahul'],'Department':['Cardiology','Neurology'],
                           'Doctor':['Dr.Smith','Dr.John'],'BillAmount':[5983,5252],'InsuranceCovered':[1500,2000],'FinalAmount':[3200,4500]})

In [23]:
new_patients

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,106,James,Cardiology,Dr.Smith,5983,1500,3200
1,107,Rahul,Neurology,Dr.John,5252,2000,4500

In [29]:
concat_df=pd.concat([merged_df,new_patients],ignore_index=True)

In [30]:
concat_df

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,2000.0,3000.0
1,102,Bob,Neurology,Dr. John,5925.0,1500.0,3500.0
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,2500.0,5000.0
3,104,David,Cardiology,Dr. Smith,6200.0,3000.0,3200.0
4,105,Eva,Dermatology,Dr. Rose,5925.0,1000.0,4000.0
5,101,Alice,Cardiology,Dr. Smith,5000.0,2000.0,3000.0
6,106,James,NaN,NaN,NaN,NaN,NaN
7,107,Rahul,NaN,NaN,NaN,NaN,NaN

In [31]:
concat_df.drop_duplicates(inplace=True,ignore_index=True)

In [32]:
concat_df

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,2000.0,3000.0
1,102,Bob,Neurology,Dr. John,5925.0,1500.0,3500.0
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,2500.0,5000.0
3,104,David,Cardiology,Dr. Smith,6200.0,3000.0,3200.0
4,105,Eva,Dermatology,Dr. Rose,5925.0,1000.0,4000.0
5,106,James,NaN,NaN,NaN,NaN,NaN
6,107,Rahul,NaN,NaN,NaN,NaN,NaN